---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.BeginConnectorIndex
source: html/c27909da-bb93-2983-df7c-4121061d7143.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.BeginConnectorIndex Property

The index of the begin connector of the flow path.

## Syntax (C#)
```csharp
public int BeginConnectorIndex { get; }
```